<!doctype html>
<html lang="fr">
  <head>
    <title>Page personnelle - David Leturcq</title>
    <meta content="">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="robots" content="index, follow">
    <style></style>
  </head>
  <body>
  <h1> David Leturcq </h1> 

Pour des raisons variées, et principalement pour des raisons de préférence personnelle, j'ai arrêté la recherche à l'été 2021. J'ai cependant décidé de remettre en ligne ma page personnelle de l'époque pour rester joignable pour les anciens collègues, notamment en cas de questions sur mes articles précédents. Je ne compte pas reprendre jamais la recherche dans le monde universitaire, je suis très heureux dans la situation actuelle. En revanche, si le temps me le permet, et si j'en trouve la motivation un jour, j'essaierai peut-être de prépublier les derniers résultats que j'avais annoncés durant mon post-doc et que je n'ai jamais fini de rédiger. 

  <h2> Curriculum Vit&aelig; %(<a href = "http://www.kurims.kyoto-u.ac.jp/~dleturcq/CV.pdf">version fran&ccedil;aise</a>, <a href = "http://www.kurims.kyoto-u.ac.jp/~dleturcq/cv_Anglais.pdf">English version</a>) :  </h2>
  <ul> 
  <li> 2021- aujourd'hui :  enseignement en collège (6e-5e).
    <li> 2020-2021 : contrat post-doctoral financé par la Japan Society for the Promotion of Science (JSPS) au Research Institute for Mathematical Sciences (RIMS), Ky&#333;to University.
  <li> 2017-2020 : doctorant contractuel à l'<a href = "https://www-fourier.ujf-grenoble.fr/">Institut Fourier</a> sous la direction de Christine Lescop. Thèse soutenue le 3 juillet 2020.
  <li> 2016-2017 : Préparation de l'agr&eacute;gation à l'ENS Lyon.
  <li> 2015-2016 : Master 2 en mathématiques fondamentales à l'Universit&eacute; Pierre et Marie Curie (Paris VI-Jussieu).
  <li> 2013-2017 : Élève à l'&Eacute;cole Normale Sup&eacute;rieure.
  </ul>
  
  <h2> Contact</h2> 
Adresse électronique : leturcq atsign d.orange.fr
  
  <h2>Recherche</h2>

<h3> Studied topics</h3>

  <div>Mon sujet principal est la th&eacute;orie des n&oelig;uds, avec des m&eacute;thodes qui font appel &agrave; des outils de topologie alg&eacute;brique, et de g&eacute;om&eacute;trie diff&eacute;rentielle. </div>
  <div>Dans ma th&egrave;se, je me suis int&eacute;ress&eacute; &agrave; des invariants d'isotopie de n&oelig;uds longs de dimension impaire, qui sont des plongements de <b>R<SUP>n</SUP></b> (n au moins 3) dans des espaces obtenus &agrave; partir de <b>R<SUP>n+2</SUP></b> en rempla&ccedil;ant la boule unit&eacute; par une vari&eacute;t&eacute; compacte de m&ecirc;me homologie enti&egrave;re et de m&ecirc;me bord. Ces invariants sont construits en combinant le &laquo; comptage &raquo; de plusieurs graphes particuliers, dont certains sommets sont sur le n&oelig;ud, et d'autres dans l'espace ambiant, ou, de mani&egrave;re &eacute;quivalente, en calculant des int&eacute;grales sur des espaces de configurations associ&eacute;s au n&oelig;ud. Dans le premier article de mon manuscrit, je donne des d&eacute;finitions plus flexibles de ces invariants, initialement uniquement d&eacute;finis pour les n&oelig;uds longs de <b>R<SUP>n+2</SUP></b>. Le second article utilise ces d&eacute;finitions flexibles pour calculer les invariants et les exprimer en fonction de nombres d'enlacements de certains cycles d'une hypersurface dont le bord est le n&oelig;ud et de les relier aux polyn&ocirc;mes d'Alexander des n&oelig;uds de haute dimension, ou, plus pr&eacute;cis&eacute;ment, &agrave; la torsion de Reidemeister (i. e. le produit altern&eacute; des polyn&ocirc;mes d'Alexander) de ces n&oelig;uds. </div>
  <div> Dans un troisi&egrave;me article, je d&eacute;montre que ces invariants sont bien d&eacute;finis en dimension 1, et je les relie au d&eacute;veloppement perturbatif de la th&eacute;rie de Chern-Simons. Les r&eacute;sultats du second article permettent alors d'exprimer le polyn&ocirc;me d'Alexander des n&oelig;uds longs en fonction de ce d&eacute;veloppement perturbatif, ce qui g&eacute;n&eacute;ralise un r&eacute;sultat connu dans <b>R<SUP>3</b> aux <b>R<SUP>3</b> asymptotiques d'homologie rationnelle, par des arguments ind&eacute;pendants de la d&eacute;monstration initiale.</div>
  <div> Dans des travaux postérieurs, pour l'instant non rédigés, j'ai travaillé à définir ces invariants en dimension paire, ce qui permettra d'y obtenir une formule comme au second article. 
  Ce qui reste en revanche à l'état de travail inachevé pour l'instant est de d&eacute;finir des cocycles sur l'espace des plongements de R<SUP>n<SUP> d'homologie asymptotiques dans des R<SUP>p<SUP> d'homologie asymptotiques en utilisant les m&ecirc;mes m&eacute;thodes de comptage de diagrammes, en comptant une famille plus grande de diagrammes.</div>
    
 <h3> Ph. D. thesis </h3>
 
 <a href = "http://www.kurims.kyoto-u.ac.jp/~dleturcq/0main.pdf "> Here </a> is my Ph. D. thesis "Counting spatial configurations in odd dimension with the Reidemeister torsion". It was done under the supervision of Christine Lescop 
 at Institut Fourier, and I defended on July 3rd 2020.
 
  <h3> Articles</h3>
  <ul>
  <li> "Bott-Cattaneo-Rossi invariants for long knots in asymptotic homology <b>R<SUP>3</b>", November 2020,  <a href = "https://arxiv.org/abs/2011.03926"> Arxiv:2011.03926</a>
  <li> "Generalized Bott-Cattaneo-Rossi invariants in terms of Alexander polynomials" (previously "The Reidemeister torsion of high-dimensional long knots from configuration space integrals"), March 2020,  <a href = "https://arxiv.org/abs/2003.01007"> Arxiv:2003.01007</a>
  <li>  "Generalized Bott-Cattaneo-Rossi invariants of high-dimensional long knots", June 2019 (accepted for publication in
Journal of the Mathematical Society of Japan in September 2020), <a href = "https://arxiv.org/abs/1907.01712"> Arxiv:1907.01712</a>
  </ul>

<h3> Slides</h3>
 Here are the slides of some talks I gave and of my Ph. D. defense (I do not reproduce all of them because of  the inclusion of some small talks inside the long ones).
 <ul>
<li> 50 minutes talk at KTGU (Kyoto Top Global University) on Feb. 17 2021 : <a href = "http://www.kurims.kyoto-u.ac.jp/~dleturcq/KTGU.pdf"> (condensed) slides</a>
<li> Ph. D. defense : <a href = "http://www.kurims.kyoto-u.ac.jp/~dleturcq/Soutenance_Diapos.pdf"> slides</a> and <a href = "http://www.kurims.kyoto-u.ac.jp/~dleturcq/0main.pdf"> manuscript</a>.
<li> Poster and slides for a flash talk in Winter Braids IX (Mars 2019) : <a href = "http://www.kurims.kyoto-u.ac.jp/~dleturcq/Poster.pdf"> poster</a>, and  <a href = "http://www.kurims.kyoto-u.ac.jp/~dleturcq/Beamer.pdf">slides</a>.
</ul>


 
  </body>
</html>